package by.academy.classwork.Base;

public class Task1 {

	public static void main(String[] args) {
//		1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
		for (int i = 10; i <= 20; i++) {
			int num = i * i;
			System.out.println(num);
		}
	}

}
